In [2]:
import pandas as pd
import numpy as np

## Create Data

In [3]:
mydata={'col1':[1,2,3,4],
        'col2':[444,555,666,444],
        'col3':['abc','def','ghi','xyz']}

In [4]:
df = pd.DataFrame(data=mydata)

In [5]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Removing Columns

In [8]:
df.drop('col1',axis=1) #inplace=True

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

## Renaming Columns

#### Method 1

In [12]:
df.columns

Index(['Num1', 'Num2', 'Char1'], dtype='object')

In [13]:
df.columns = ['Num1','Num2','Char1']

In [14]:
df

   Num1  Num2 Char1
0     1   444   abc
1     2   555   def
2     3   666   ghi
3     4   444   xyz

#### Method 2

In [15]:
df

   Num1  Num2 Char1
0     1   444   abc
1     2   555   def
2     3   666   ghi
3     4   444   xyz

In [16]:
df.rename(columns={"Num1": "NewColName"})

   NewColName  Num2 Char1
0           1   444   abc
1           2   555   def
2           3   666   ghi
3           4   444   xyz